
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   11.2   Copyright 1985-2009 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  50110563506
         Licensed to:  Stephen O'Connell
                       City University of New York

Notes:
      1.  (/m# option or -set memory-) 2048.00 MB allocated to data
      2.  (/v# option or -set maxvar-) 5000 maximum variables
      3.  Stata running in batch mode

. do ..\..\2progs\05_Clean_Prep_NSS_Data_fordistrictborderanalysis.do 

. ************************************************************************
. ***************Ghani - Kerr - O'Connell                  ***************
> ********
. ***************Political Reservations and Women's Entrepreneuship*******
. ***************Journal of Development Economics, 2014 ******************
. ***************Replication Backup                                *******
> ****************
. ************************************************************************
. clear

. clear matrix

. clear mata

. cap log close

. 
. global root "C:/OpenCode/GKO_Reservations_JDE2014_ReplBackup"

. include "$root/2progs/00_Set_paths.do"

. version 11.0

. dis "$root"
C:/OpenCode/GKO_Reservations_JDE2014_ReplBackup

. assert "$root" !="" //assert root capture worked for user

. global data "$root/1data/"

. global do "$root/2progs/"

. global figures "$root/3figures/"

. global work "$root/4work/"

. global intdata "$root/5intdata/"

. global finaldata "$root/6finaldata/"

. global date=c(current_date)

. global time=subinstr(c(current_time),":","",.)

. cd "$work" //default directory to put files, although all outputs should
>  be directed via a global macro
C:\OpenCode\GKO_Reservations_JDE2014_ReplBackup\4work

. set seed 99

. set mem 2g, perm

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.947M
    set memory         2048M    max. data space              2,048.000M
    set matsize         800     max. RHS vars in models          4.950M
                                                            -----------
                                                             2,054.897M
(set memory preference recorded)

. 
. 
. ************************************************************************
. ************************************************************************
. use "$intdata/ASINSS_AppendedMaster_CleanFlagged.dta", clear

. 
. /***********************        LIST OF FLAGS IN DATA
> output_per_worker_flag
> NSS_toobig_flag
> emp_outlier_flag
> services_flag
> state_sample_flag
> null_totalemployees_flag
> no_totalemployees_flag
> neg_totalemployees_flag
> null_totaloutput_flag
> no_totaloutput_flag
> neg_totaloutput_flag
> null_totalrawmaterials_flag
> no_totalrawmaterials_flag
> neg_totalrawmaterials_flag
> null_totalfixedassets_flag
> no_totalfixedassets_flag
> neg_totalfixedassets_flag
> high_output_flag
> */
. **********************
. 
. /*THIS SET STILL OK
> output_per_worker_flag
> emp_outlier_flag
> services_flag
> high_output_flag
> no_totalemployees_flag
> null_totaloutput_flag
> no_totaloutput_flag
> 
> */
. 
. /*DO NOT APPLY THESE
> NSS_toobig_flag
> state_sample_flag
> 
> null_totalrawmaterials_flag
> no_totalrawmaterials_flag
> neg_totalrawmaterials_flag
> null_totalfixedassets_flag
> no_totalfixedassets_flag
> 
> Ineffective for NSS:
> neg_totalfixedassets_flag
> neg_totaloutput_flag
> null_totalemployees_flag
> neg_totalemployees_flag
> */
. 
. g anyflg=0

. foreach var of varlist output_per_worker_flag emp_outlier_flag services_
> flag high_output_flag no_totalemployees_flag null_totaloutput_flag no_to
> taloutput_flag {
  2. tab dataset `var'
  3. replace anyflg=1 if `var'==1
  4. }

           | output_per_worker_fla
           |           g
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    53,872        116 |    53,988 
   ASI2000 |    30,971        160 |    31,131 
   ASI2005 |    43,418        320 |    43,738 
   NSS1994 |   192,028          1 |   192,029 
   NSS2000 |   222,525          4 |   222,529 
   NSS2005 |    82,852         45 |    82,897 
-----------+----------------------+----------
     Total |   625,666        646 |   626,312 

(646 real changes made)

           | emp_outlie
           |   r_flag
   dataset |         0 |     Total
-----------+-----------+----------
   ASI1994 |    53,988 |    53,988 
   ASI2000 |    31,131 |    31,131 
   ASI2005 |    43,738 |    43,738 
   NSS1994 |   192,029 |   192,029 
   NSS2000 |   222,529 |   222,529 
   NSS2005 |    82,897 |    82,897 
-----------+-----------+----------
     Total |   626,312 |   626,312 

(0 real changes made)

           |     services_flag
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    50,008      3,980 |    53,988 
   ASI2000 |    29,565      1,566 |    31,131 
   ASI2005 |    41,362      2,376 |    43,738 
   NSS1994 |   162,077     29,952 |   192,029 
   NSS2000 |   221,841        688 |   222,529 
   NSS2005 |    82,685        212 |    82,897 
-----------+----------------------+----------
     Total |   587,538     38,774 |   626,312 

(38774 real changes made)

           |   high_output_flag
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    42,904     11,084 |    53,988 
   ASI2000 |    25,784      5,347 |    31,131 
   ASI2005 |    35,550      8,188 |    43,738 
   NSS1994 |   162,018     30,011 |   192,029 
   NSS2000 |   221,836        693 |   222,529 
   NSS2005 |    82,030        867 |    82,897 
-----------+----------------------+----------
     Total |   570,122     56,190 |   626,312 

(17350 real changes made)

           | no_totalemployees_fla
           |           g
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    53,978         10 |    53,988 
   ASI2000 |    31,128          3 |    31,131 
   ASI2005 |    43,738          0 |    43,738 
   NSS1994 |   186,737      5,292 |   192,029 
   NSS2000 |   222,529          0 |   222,529 
   NSS2005 |    82,867         30 |    82,897 
-----------+----------------------+----------
     Total |   620,977      5,335 |   626,312 

(5103 real changes made)

           | null_totaloutput_flag
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    42,929     11,059 |    53,988 
   ASI2000 |    25,831      5,300 |    31,131 
   ASI2005 |    35,629      8,109 |    43,738 
   NSS1994 |   162,018     30,011 |   192,029 
   NSS2000 |   221,836        693 |   222,529 
   NSS2005 |    82,030        867 |    82,897 
-----------+----------------------+----------
     Total |   570,273     56,039 |   626,312 

(0 real changes made)

           |  no_totaloutput_flag
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    53,929         59 |    53,988 
   ASI2000 |    31,067         64 |    31,131 
   ASI2005 |    43,585        153 |    43,738 
   NSS1994 |   191,834        195 |   192,029 
   NSS2000 |   221,179      1,350 |   222,529 
   NSS2005 |    82,881         16 |    82,897 
-----------+----------------------+----------
     Total |   624,475      1,837 |   626,312 

(1828 real changes made)

. 
. 
. tab dataset anyflg

           |        anyflg
   dataset |         0          1 |     Total
-----------+----------------------+----------
   ASI1994 |    42,733     11,255 |    53,988 
   ASI2000 |    25,578      5,553 |    31,131 
   ASI2005 |    35,112      8,626 |    43,738 
   NSS1994 |   156,754     35,275 |   192,029 
   NSS2000 |   220,482      2,047 |   222,529 
   NSS2005 |    81,952        945 |    82,897 
-----------+----------------------+----------
     Total |   562,611     63,701 |   626,312 


. drop if anyflg
(63701 observations deleted)

.         drop anyflg

. 
. 
. *collapse (sum) plants-fixedcapitalformation selfemp_estab selfemp_emp n
> ew_estab_uniplant new_emp_uniplant singleunit informal_emp new_emp infor
> mal_estab formal_estab new_estab new_estab_informal new_estab_formal sma
> ll_emp small_estab female_estab female_emp male_estab male_emp, by (  ye
> ar state state_ORIGINAL district ruralurban organization ownership locat
> ion nic304 nic404 nic3description nic204 nic2desc  fsize*  under3 enttyp
> e)
. keep plants-fixedcapitalformation totalunpaidemp multiplier year state s
> tate_ORIGINAL district ruralurban organization ownership location nic304
>  nic404 nic204 under3 age enttype ruralurban survey traditional_loan int
> erestamount typecontract source* dest* 

. 
. compress

. 
. 
. *****merge in districts to get consistently-defined states
. replace state_ORIG=upper(state_ORIG)
(459188 real changes made)

. replace state_ORIG="A & N ISLANDS" if state_ORIG=="ANDAMAN AND NICOBAR I
> SLANDS"
(48 real changes made)

. replace state_ORIG="CHHATTISGARH" if state_ORIG=="CHHATISGARH"
(937 real changes made)

. replace state_ORIG="DADRA & NAGAR HAVELI" if state_ORIG=="DADRA  AND  NA
> GAR  HAVELI"
(871 real changes made)

. replace state_ORIG="DAMAN & DIU" if state_ORIG=="DAMAN  &  DIU "
(1017 real changes made)

. replace state_ORIG="MAHARASHTRA" if state_ORIG=="MAHARASTRA"
(33577 real changes made)

. replace state_ORIG="PONDICHERRY" if state_ORIG=="PONDICHERI"
(939 real changes made)

. 
. 
. *****THIS IS DONE BECAUSE WE WILL EXPLOIT THE STATE BORDERS AS OF 2005, 
> SO WE NEED TO DISTINGUISH THESE SAME AREAS IN 1994 IN THE CONTROLS
. bys survey: tab state_ORIG year

--------------------------------------------------------------------------
-> survey = ASI

                      |               year
       state_ORIGINAL |      1994       2000       2005 |     Total
----------------------+---------------------------------+----------
        A & N ISLANDS |        27         15          6 |        48 
       ANDHRA PRADESH |     3,483      1,860      2,873 |     8,216 
                ASSAM |       735        568        689 |     1,992 
                BIHAR |     1,164        376        483 |     2,023 
           CHANDIGARH |       269        115        159 |       543 
         CHHATTISGARH |         0        394        543 |       937 
 DADRA & NAGAR HAVELI |       153        287        431 |       871 
          DAMAN & DIU |       213        315        489 |     1,017 
                DELHI |     1,569        719        822 |     3,110 
                  GOA |       214        256        325 |       795 
              GUJARAT |     4,356      2,187      3,190 |     9,733 
              HARYANA |     1,706      1,157      1,434 |     4,297 
     HIMACHAL PRADESH |       269        239        496 |     1,004 
      JAMMU & KASHMIR |       244        185        343 |       772 
            JHARKHAND |         0        381        494 |       875 
            KARNATAKA |     2,206      1,467      1,854 |     5,527 
               KERALA |     1,581        975      1,101 |     3,657 
       MADHYA PRADESH |     1,716        794        878 |     3,388 
          MAHARASHTRA |     5,515      3,021      4,234 |    12,770 
              MANIPUR |        45         23         35 |       103 
            MEGHALAYA |        23         24         57 |       104 
             NAGALAND |        54         78         66 |       198 
               ORISSA |       848        461        597 |     1,906 
          PONDICHERRY |       217        240        322 |       779 
               PUNJAB |     2,501      1,403      2,485 |     6,389 
            RAJASTHAN |     1,819      1,031      1,518 |     4,368 
           TAMIL NADU |     5,035      3,211      4,116 |    12,362 
              TRIPURA |        88        160        239 |       487 
        UTTAR PRADESH |     4,431      1,979      2,790 |     9,200 
          UTTARANCHAL |         0        319        447 |       766 
          WEST BENGAL |     2,252      1,338      1,596 |     5,186 
----------------------+---------------------------------+----------
                Total |    42,733     25,578     35,112 |   103,423 


--------------------------------------------------------------------------
-> survey = NSS

                      |               year
       state_ORIGINAL |      1994       2000       2005 |     Total
----------------------+---------------------------------+----------
        A & N ISLANDS |       534        582        219 |     1,335 
       ANDHRA PRADESH |    14,438     17,527      6,483 |    38,448 
    ARUNACHAL PRADESH |       211        156        101 |       468 
                ASSAM |     3,381      6,007      2,870 |    12,258 
                BIHAR |    11,799     12,155      3,806 |    27,760 
           CHANDIGARH |       288        330         56 |       674 
         CHHATTISGARH |         0      2,920        866 |     3,786 
 DADRA & NAGAR HAVELI |       176        221        117 |       514 
          DAMAN & DIU |       147        204        154 |       505 
                DELHI |     1,654      2,002        555 |     4,211 
                  GOA |       349        793        260 |     1,402 
              GUJARAT |     6,188      9,660      3,487 |    19,335 
              HARYANA |     1,736      4,091      2,126 |     7,953 
     HIMACHAL PRADESH |     1,962      3,787      1,489 |     7,238 
      JAMMU & KASHMIR |     1,192      5,825      2,513 |     9,530 
            JHARKHAND |         0      5,367      1,767 |     7,134 
            KARNATAKA |     7,750      8,599      3,431 |    19,780 
               KERALA |     5,565     10,106      3,963 |    19,634 
          LAKSHADWEEP |        17         71         77 |       165 
       MADHYA PRADESH |     6,009     10,638      3,736 |    20,383 
          MAHARASHTRA |     8,462     18,711      6,404 |    33,577 
              MANIPUR |     1,676      3,426      1,160 |     6,262 
            MEGHALAYA |       655      1,045        540 |     2,240 
              MIZORAM |       394      1,215        453 |     2,062 
             NAGALAND |     1,034      1,506        693 |     3,233 
               ORISSA |     7,533      6,853      3,248 |    17,634 
          PONDICHERRY |       110        516        313 |       939 
               PUNJAB |     3,682      9,570      2,992 |    16,244 
            RAJASTHAN |     4,745     10,094      4,450 |    19,289 
               SIKKIM |        96        269        262 |       627 
           TAMIL NADU |    22,770     19,093      6,567 |    48,430 
              TRIPURA |     2,544      3,565      1,600 |     7,709 
        UTTAR PRADESH |    20,866     24,750      8,084 |    53,700 
          UTTARANCHAL |         0      1,507        555 |     2,062 
          WEST BENGAL |    18,791     17,321      6,555 |    42,667 
----------------------+---------------------------------+----------
                Total |   156,754    220,482     81,952 |   459,188 



. g FinalState=state_ORIG

. destring district, replace
district has all characters numeric; replaced as byte

. replace FinalState="JHARKHAND" if state_ORIG=="BIHAR" & year==1994 & dis
> trict>=28 & district<=40
(4467 real changes made)

. replace FinalState="CHHATTISGARH" if state_ORIG=="MADHYA PRADESH" & year
> ==1994 & district>=39 & district<=45
(1858 real changes made)

. replace FinalState="UTTARANCHAL" if state_ORIG=="UTTAR PRADESH" & year==
> 1994 & ((district>=1 & district<=8) | district==13)
(787 real changes made)

. 
. bys survey: tab FinalState year

--------------------------------------------------------------------------
-> survey = ASI

                     |               year
          FinalState |      1994       2000       2005 |     Total
---------------------+---------------------------------+----------
       A & N ISLANDS |        27         15          6 |        48 
      ANDHRA PRADESH |     3,483      1,860      2,873 |     8,216 
               ASSAM |       735        568        689 |     1,992 
               BIHAR |       565        376        483 |     1,424 
          CHANDIGARH |       269        115        159 |       543 
        CHHATTISGARH |       481        394        543 |     1,418 
DADRA & NAGAR HAVELI |       153        287        431 |       871 
         DAMAN & DIU |       213        315        489 |     1,017 
               DELHI |     1,569        719        822 |     3,110 
                 GOA |       214        256        325 |       795 
             GUJARAT |     4,356      2,187      3,190 |     9,733 
             HARYANA |     1,706      1,157      1,434 |     4,297 
    HIMACHAL PRADESH |       269        239        496 |     1,004 
     JAMMU & KASHMIR |       244        185        343 |       772 
           JHARKHAND |       599        381        494 |     1,474 
           KARNATAKA |     2,206      1,467      1,854 |     5,527 
              KERALA |     1,581        975      1,101 |     3,657 
      MADHYA PRADESH |     1,235        794        878 |     2,907 
         MAHARASHTRA |     5,515      3,021      4,234 |    12,770 
             MANIPUR |        45         23         35 |       103 
           MEGHALAYA |        23         24         57 |       104 
            NAGALAND |        54         78         66 |       198 
              ORISSA |       848        461        597 |     1,906 
         PONDICHERRY |       217        240        322 |       779 
              PUNJAB |     2,501      1,403      2,485 |     6,389 
           RAJASTHAN |     1,819      1,031      1,518 |     4,368 
          TAMIL NADU |     5,035      3,211      4,116 |    12,362 
             TRIPURA |        88        160        239 |       487 
       UTTAR PRADESH |     4,146      1,979      2,790 |     8,915 
         UTTARANCHAL |       285        319        447 |     1,051 
         WEST BENGAL |     2,252      1,338      1,596 |     5,186 
---------------------+---------------------------------+----------
               Total |    42,733     25,578     35,112 |   103,423 


--------------------------------------------------------------------------
-> survey = NSS

                     |               year
          FinalState |      1994       2000       2005 |     Total
---------------------+---------------------------------+----------
       A & N ISLANDS |       534        582        219 |     1,335 
      ANDHRA PRADESH |    14,438     17,527      6,483 |    38,448 
   ARUNACHAL PRADESH |       211        156        101 |       468 
               ASSAM |     3,381      6,007      2,870 |    12,258 
               BIHAR |     7,931     12,155      3,806 |    23,892 
          CHANDIGARH |       288        330         56 |       674 
        CHHATTISGARH |     1,377      2,920        866 |     5,163 
DADRA & NAGAR HAVELI |       176        221        117 |       514 
         DAMAN & DIU |       147        204        154 |       505 
               DELHI |     1,654      2,002        555 |     4,211 
                 GOA |       349        793        260 |     1,402 
             GUJARAT |     6,188      9,660      3,487 |    19,335 
             HARYANA |     1,736      4,091      2,126 |     7,953 
    HIMACHAL PRADESH |     1,962      3,787      1,489 |     7,238 
     JAMMU & KASHMIR |     1,192      5,825      2,513 |     9,530 
           JHARKHAND |     3,868      5,367      1,767 |    11,002 
           KARNATAKA |     7,750      8,599      3,431 |    19,780 
              KERALA |     5,565     10,106      3,963 |    19,634 
         LAKSHADWEEP |        17         71         77 |       165 
      MADHYA PRADESH |     4,632     10,638      3,736 |    19,006 
         MAHARASHTRA |     8,462     18,711      6,404 |    33,577 
             MANIPUR |     1,676      3,426      1,160 |     6,262 
           MEGHALAYA |       655      1,045        540 |     2,240 
             MIZORAM |       394      1,215        453 |     2,062 
            NAGALAND |     1,034      1,506        693 |     3,233 
              ORISSA |     7,533      6,853      3,248 |    17,634 
         PONDICHERRY |       110        516        313 |       939 
              PUNJAB |     3,682      9,570      2,992 |    16,244 
           RAJASTHAN |     4,745     10,094      4,450 |    19,289 
              SIKKIM |        96        269        262 |       627 
          TAMIL NADU |    22,770     19,093      6,567 |    48,430 
             TRIPURA |     2,544      3,565      1,600 |     7,709 
       UTTAR PRADESH |    20,364     24,750      8,084 |    53,198 
         UTTARANCHAL |       502      1,507        555 |     2,564 
         WEST BENGAL |    18,791     17,321      6,555 |    42,667 
---------------------+---------------------------------+----------
               Total |   156,754    220,482     81,952 |   459,188 



. 
. rename state state_CONSISTENT

. rename FinalState state

. 
. 
. 
. merge m:1 state year using "$work/Reserved Elections Data_By StateYear.d
> ta"
year was int now float

    Result                           # of obs.
    -----------------------------------------
    not matched                           665
        from master                         0  (_merge==1)
        from using                        665  (_merge==2)

    matched                           562,611  (_merge==3)
    -----------------------------------------

.         drop if _m==2
(665 observations deleted)

.         assert _m==3

.         drop _merge

. 
. 
. *******************
. ***     MERGE IN DISTRICT NAMES & COLLAPSE ON STANDARDIZED NAME FOR FUTU
> RE MERGES
. *******************
. replace year=2001 if year==2000
(246060 real changes made)

. merge m:1 state_ORIGINAL district year survey using "$data/Districts/NSS
>  District codes & names.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                       118,230
        from master                   118,150  (_merge==1)
        from using                         80  (_merge==2)

    matched                           444,461  (_merge==3)
    -----------------------------------------

. replace year=2000 if year==2001
(246109 real changes made)

. drop if _m==2
(80 observations deleted)

. tab state_ORIGINAL _merge, mi

                      |        _merge
       state_ORIGINAL | master on  matched ( |     Total
----------------------+----------------------+----------
        A & N ISLANDS |        48      1,335 |     1,383 
       ANDHRA PRADESH |     8,216     38,448 |    46,664 
    ARUNACHAL PRADESH |         0        468 |       468 
                ASSAM |     1,992     12,258 |    14,250 
                BIHAR |     2,023     27,760 |    29,783 
           CHANDIGARH |       543        674 |     1,217 
         CHHATTISGARH |     3,857        866 |     4,723 
 DADRA & NAGAR HAVELI |       871        514 |     1,385 
          DAMAN & DIU |     1,017        505 |     1,522 
                DELHI |     3,428      3,893 |     7,321 
                  GOA |       795      1,402 |     2,197 
              GUJARAT |    12,168     16,900 |    29,068 
              HARYANA |     4,297      7,953 |    12,250 
     HIMACHAL PRADESH |     1,004      7,238 |     8,242 
      JAMMU & KASHMIR |       772      9,530 |    10,302 
            JHARKHAND |     6,242      1,767 |     8,009 
            KARNATAKA |     7,646     17,661 |    25,307 
               KERALA |     3,657     19,634 |    23,291 
          LAKSHADWEEP |         0        165 |       165 
       MADHYA PRADESH |     3,388     20,383 |    23,771 
          MAHARASHTRA |    12,770     33,577 |    46,347 
              MANIPUR |       103      6,262 |     6,365 
            MEGHALAYA |       105      2,239 |     2,344 
              MIZORAM |         0      2,062 |     2,062 
             NAGALAND |       198      3,233 |     3,431 
               ORISSA |     1,906     17,634 |    19,540 
          PONDICHERRY |       806        912 |     1,718 
               PUNJAB |     6,389     16,244 |    22,633 
            RAJASTHAN |     4,368     19,289 |    23,657 
               SIKKIM |         0        627 |       627 
           TAMIL NADU |    12,395     48,397 |    60,792 
              TRIPURA |       487      7,709 |     8,196 
        UTTAR PRADESH |     9,200     53,700 |    62,900 
          UTTARANCHAL |     2,273        555 |     2,828 
          WEST BENGAL |     5,186     42,667 |    47,853 
----------------------+----------------------+----------
                Total |   118,150    444,461 |   562,611 


. tab state_ORIGINAL year if _m==1

                      |               year
       state_ORIGINAL |      1994       2000       2005 |     Total
----------------------+---------------------------------+----------
        A & N ISLANDS |        27         15          6 |        48 
       ANDHRA PRADESH |     3,483      1,860      2,873 |     8,216 
                ASSAM |       735        568        689 |     1,992 
                BIHAR |     1,164        376        483 |     2,023 
           CHANDIGARH |       269        115        159 |       543 
         CHHATTISGARH |         0      3,314        543 |     3,857 
 DADRA & NAGAR HAVELI |       153        287        431 |       871 
          DAMAN & DIU |       213        315        489 |     1,017 
                DELHI |     1,569        719      1,140 |     3,428 
                  GOA |       214        256        325 |       795 
              GUJARAT |     4,356      4,622      3,190 |    12,168 
              HARYANA |     1,706      1,157      1,434 |     4,297 
     HIMACHAL PRADESH |       269        239        496 |     1,004 
      JAMMU & KASHMIR |       244        185        343 |       772 
            JHARKHAND |         0      5,748        494 |     6,242 
            KARNATAKA |     2,206      3,586      1,854 |     7,646 
               KERALA |     1,581        975      1,101 |     3,657 
       MADHYA PRADESH |     1,716        794        878 |     3,388 
          MAHARASHTRA |     5,515      3,021      4,234 |    12,770 
              MANIPUR |        45         23         35 |       103 
            MEGHALAYA |        23         24         58 |       105 
             NAGALAND |        54         78         66 |       198 
               ORISSA |       848        461        597 |     1,906 
          PONDICHERRY |       217        267        322 |       806 
               PUNJAB |     2,501      1,403      2,485 |     6,389 
            RAJASTHAN |     1,819      1,031      1,518 |     4,368 
           TAMIL NADU |     5,068      3,211      4,116 |    12,395 
              TRIPURA |        88        160        239 |       487 
        UTTAR PRADESH |     4,431      1,979      2,790 |     9,200 
          UTTARANCHAL |         0      1,826        447 |     2,273 
          WEST BENGAL |     2,252      1,338      1,596 |     5,186 
----------------------+---------------------------------+----------
                Total |    42,766     39,953     35,431 |   118,150 


. bysort state_ORIGINAL: tab district year if _m==1

--------------------------------------------------------------------------
-> state_ORIGINAL = A & N ISLANDS

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |        25         15          6 |        46 
         2 |         1          0          0 |         1 
        17 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |        27         15          6 |        48 


--------------------------------------------------------------------------
-> state_ORIGINAL = ANDHRA PRADESH

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         5          0          0 |         5 
         1 |        67         16         19 |       102 
         2 |       108         70        103 |       281 
         3 |       116         34         70 |       220 
         4 |       226        160        211 |       597 
         5 |       138         86        109 |       333 
         6 |       225        361        563 |     1,149 
         7 |       273         48         61 |       382 
         8 |       114         72         76 |       262 
         9 |        84         30         48 |       162 
        10 |       148         32         91 |       271 
        11 |        59         47         92 |       198 
        12 |       146         31         53 |       230 
        13 |       142         84        126 |       352 
        14 |        68        128        197 |       393 
        15 |       583         86        150 |       819 
        16 |       217        127        158 |       502 
        17 |       264        117        287 |       668 
        18 |       121         51         43 |       215 
        19 |        39         43         80 |       162 
        20 |        99         17         39 |       155 
        21 |        55         82        116 |       253 
        22 |        53         54         68 |       175 
        23 |       120         84        113 |       317 
        25 |         2          0          0 |         2 
        26 |         3          0          0 |         3 
        28 |         1          0          0 |         1 
        29 |         1          0          0 |         1 
        31 |         1          0          0 |         1 
        41 |         1          0          0 |         1 
        47 |         1          0          0 |         1 
        60 |         1          0          0 |         1 
        61 |         1          0          0 |         1 
        70 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     3,483      1,860      2,873 |     8,216 


--------------------------------------------------------------------------
-> state_ORIGINAL = ARUNACHAL PRADESH
no observations

--------------------------------------------------------------------------
-> state_ORIGINAL = ASSAM

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         5          0          0 |         5 
         1 |        18          2          5 |        25 
         2 |         1          3         11 |        15 
         3 |        12          0          0 |        12 
         4 |         4          0          6 |        10 
         5 |         7          1          2 |        10 
         6 |         5        111        191 |       307 
         7 |       137          7          5 |       149 
         8 |        29         32         31 |        92 
         9 |        67          0          7 |        74 
        10 |        14         17         32 |        63 
        11 |         1         74         64 |       139 
        12 |         7         12          9 |        28 
        13 |        25          0          0 |        25 
        14 |        38         65         70 |       173 
        15 |        43         96         85 |       224 
        16 |        40         31         40 |       111 
        17 |        93         29         51 |       173 
        18 |       109         26         28 |       163 
        19 |         4          0          1 |         5 
        20 |         4          3          3 |        10 
        21 |        13         41         29 |        83 
        22 |         9         12          9 |        30 
        23 |        48          6         10 |        64 
        26 |         1          0          0 |         1 
        49 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       735        568        689 |     1,992 


--------------------------------------------------------------------------
-> state_ORIGINAL = BIHAR

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         5          0          0 |         5 
         1 |       146          9         11 |       166 
         2 |         3          7         12 |        22 
         3 |        16          0          1 |        17 
         4 |        18         27         14 |        59 
         5 |         5          4          7 |        16 
         6 |         0          0          2 |         2 
         7 |        21          7          6 |        34 
         8 |         2          3         19 |        24 
         9 |        14          7         11 |        32 
        10 |         9          4         22 |        35 
        11 |        10          2          5 |        17 
        12 |        16          2          5 |        23 
        13 |        11         13         33 |        57 
        14 |        12         33         30 |        75 
        15 |        33          6          6 |        45 
        16 |        10          0          4 |        14 
        17 |        19         13          4 |        36 
        18 |        14         19         21 |        54 
        19 |        35          5          8 |        48 
        20 |         3         20         13 |        36 
        21 |         8          0          0 |         8 
        22 |         2          9         15 |        26 
        23 |        59          1          3 |        63 
        24 |        13         17         12 |        42 
        25 |         0          2          5 |         7 
        26 |        24          0          4 |        28 
        27 |        18          3          5 |        26 
        28 |         1        125        107 |       233 
        29 |         8          2          8 |        18 
        30 |        10          0          5 |        15 
        31 |        21          1          0 |        22 
        32 |       181         15         40 |       236 
        33 |        24          0          0 |        24 
        34 |        58          6         18 |        82 
        35 |        12          6         22 |        40 
        36 |         2          8          1 |        11 
        37 |         5          0          4 |         9 
        38 |        74          0          0 |        74 
        39 |        69          0          0 |        69 
        40 |       134          0          0 |       134 
        43 |         2          0          0 |         2 
        46 |         1          0          0 |         1 
        52 |        28          0          0 |        28 
        53 |         6          0          0 |         6 
        77 |         1          0          0 |         1 
        98 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     1,164        376        483 |     2,023 


--------------------------------------------------------------------------
-> state_ORIGINAL = CHANDIGARH

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         2          0          0 |         2 
         1 |       262        115        159 |       536 
         5 |         1          0          0 |         1 
         7 |         1          0          0 |         1 
         9 |         2          0          0 |         2 
        14 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       269        115        159 |       543 


--------------------------------------------------------------------------
-> state_ORIGINAL = CHHATTISGARH

           |         year
  District |      2000       2005 |     Total
-----------+----------------------+----------
         2 |         0          1 |         1 
         3 |         0          1 |         1 
         4 |         9         23 |        32 
         5 |         3         16 |        19 
         6 |         4         11 |        15 
         7 |        59         61 |       120 
         8 |         0          1 |         1 
         9 |        35         37 |        72 
        10 |        74         86 |       160 
        11 |       195        266 |       461 
        12 |         4         12 |        16 
        13 |         7         17 |        24 
        14 |         0          4 |         4 
        15 |         4          7 |        11 
        39 |       125          0 |       125 
        40 |       668          0 |       668 
        41 |       296          0 |       296 
        42 |       191          0 |       191 
        43 |       405          0 |       405 
        44 |     1,050          0 |     1,050 
        45 |       185          0 |       185 
-----------+----------------------+----------
     Total |     3,314        543 |     3,857 


--------------------------------------------------------------------------
-> state_ORIGINAL = DADRA & NAGAR HAVELI

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |       151        287        431 |       869 
        10 |         1          0          0 |         1 
        81 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       153        287        431 |       871 


--------------------------------------------------------------------------
-> state_ORIGINAL = DAMAN & DIU

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |       210          0          4 |       214 
         2 |         0        315        485 |       800 
         3 |         3          0          0 |         3 
-----------+---------------------------------+----------
     Total |       213        315        489 |     1,017 


--------------------------------------------------------------------------
-> state_ORIGINAL = DELHI

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         4          0          0 |         4 
         1 |     1,551        719        187 |     2,457 
         2 |         0          0         10 |        10 
         3 |         5          0         15 |        20 
         4 |         0          0         55 |        55 
         5 |         0          0          5 |         5 
         6 |         0          0          5 |         5 
         7 |         0          0        297 |       297 
         8 |         0          0         15 |        15 
         9 |         0          0        233 |       233 
        10 |         6          0        317 |       323 
        11 |         2          0          0 |         2 
        16 |         1          0          1 |         2 
-----------+---------------------------------+----------
     Total |     1,569        719      1,140 |     3,428 


--------------------------------------------------------------------------
-> state_ORIGINAL = GOA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |       141        144        183 |       468 
         2 |        68        112        142 |       322 
        10 |         1          0          0 |         1 
        12 |         1          0          0 |         1 
        15 |         1          0          0 |         1 
        25 |         1          0          0 |         1 
        60 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       214        256        325 |       795 


--------------------------------------------------------------------------
-> state_ORIGINAL = GUJARAT

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         5          0          0 |         5 
         1 |       142         32         85 |       259 
         2 |       441          0         16 |       457 
         3 |       148         13         12 |       173 
         4 |       204         76        110 |       390 
         5 |        17         11         39 |        67 
         6 |       113        103        180 |       396 
         7 |        57        473        728 |     1,258 
         8 |         9         38         62 |       109 
         9 |        34        181        320 |       535 
        10 |       255         55         63 |       373 
        11 |        61          6          9 |        76 
        12 |       939         45         50 |     1,034 
        13 |       173         10          5 |       188 
        14 |       137        107         65 |       309 
        15 |       494         58        109 |       661 
        16 |       250         25         47 |       322 
        17 |       378         60         71 |       509 
        18 |       474         11          7 |       492 
        19 |         1        299        348 |       648 
        20 |         4        307          4 |       315 
        21 |         0        179        157 |       336 
        22 |         0      1,563        317 |     1,880 
        23 |         0        302          0 |       302 
        24 |         1        413         69 |       483 
        25 |         7        255        317 |       579 
        28 |         4          0          0 |         4 
        42 |         1          0          0 |         1 
        50 |         1          0          0 |         1 
        70 |         1          0          0 |         1 
        71 |         4          0          0 |         4 
        74 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     4,356      4,622      3,190 |    12,168 


--------------------------------------------------------------------------
-> state_ORIGINAL = HARYANA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         7          0          0 |         7 
         1 |       122         30         42 |       194 
         2 |       201         93         61 |       355 
         3 |        52         22        165 |       239 
         4 |        29          7         18 |        54 
         5 |        75         45         13 |       133 
         6 |       123         66         43 |       232 
         7 |        77         81         86 |       244 
         8 |        88         57         99 |       244 
         9 |       542        372         14 |       928 
        10 |       195        243         16 |       454 
        11 |        44         14          6 |        64 
        12 |         2          0         41 |        43 
        13 |        22          6          8 |        36 
        14 |        15          7         42 |        64 
        15 |        88         50         71 |       209 
        16 |        18         14          0 |        32 
        17 |         1         12         35 |        48 
        18 |         1         12        336 |       349 
        19 |         0         26        338 |       364 
        80 |         1          0          0 |         1 
        81 |         1          0          0 |         1 
        82 |         1          0          0 |         1 
        85 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     1,706      1,157      1,434 |     4,297 


--------------------------------------------------------------------------
-> state_ORIGINAL = HIMACHAL PRADESH

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |         4          0          0 |         4 
         2 |        22         17         32 |        71 
         4 |        20          8          5 |        33 
         5 |         4          2          6 |        12 
         6 |        13          4          0 |        17 
         7 |         3          0         32 |        35 
         8 |         0          0          6 |         6 
         9 |        12          5        336 |       353 
        10 |       154        184         73 |       411 
        11 |        34         19          6 |        59 
        12 |         1          0          0 |         1 
        14 |         1          0          0 |         1 
        18 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       269        239        496 |     1,004 


--------------------------------------------------------------------------
-> state_ORIGINAL = JAMMU & KASHMIR

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         2          0          0 |         2 
         1 |         1          2          0 |         3 
         2 |         0          0          2 |         2 
         3 |        13         29         26 |        68 
         4 |         4          3          5 |        12 
         5 |         0          0          6 |         6 
         6 |         0          0          2 |         2 
        10 |         6          3          1 |        10 
        11 |        15          3          0 |        18 
        12 |       203        145          2 |       350 
        13 |         0          0        263 |       263 
        14 |         0          0         36 |        36 
-----------+---------------------------------+----------
     Total |       244        185        343 |       772 


--------------------------------------------------------------------------
-> state_ORIGINAL = JHARKHAND

           |         year
  District |      2000       2005 |     Total
-----------+----------------------+----------
         1 |         3          2 |         5 
         2 |         1          6 |         7 
         4 |        27         45 |        72 
         5 |         4          4 |         8 
         6 |        13         22 |        35 
         7 |        20         27 |        47 
         9 |         3          8 |        11 
        10 |         7          2 |         9 
        11 |         6         12 |        18 
        12 |        76         91 |       167 
        13 |        15         37 |        52 
        14 |        76         77 |       153 
        15 |         1          0 |         1 
        16 |         4          3 |         7 
        17 |        75         96 |       171 
        18 |        50         60 |       110 
        20 |         0          2 |         2 
        28 |       186          0 |       186 
        29 |       241          0 |       241 
        30 |       269          0 |       269 
        31 |       250          0 |       250 
        32 |       763          0 |       763 
        33 |       191          0 |       191 
        34 |       364          0 |       364 
        35 |       220          0 |       220 
        36 |        64          0 |        64 
        37 |       217          0 |       217 
        38 |       645          0 |       645 
        39 |       489          0 |       489 
        40 |       350          0 |       350 
        48 |       164          0 |       164 
        49 |       501          0 |       501 
        50 |       166          0 |       166 
        51 |        90          0 |        90 
        52 |       197          0 |       197 
-----------+----------------------+----------
     Total |     5,748        494 |     6,242 


--------------------------------------------------------------------------
-> state_ORIGINAL = KARNATAKA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         9          0          0 |         9 
         1 |     1,153         99        124 |     1,376 
         2 |        47          7         11 |        65 
         3 |       132          4         11 |       147 
         4 |        27         14         15 |        56 
         5 |        21         12         13 |        46 
         6 |        38         10         27 |        75 
         7 |        20         10         19 |        49 
         8 |        58          8          3 |        69 
         9 |       193         54         64 |       311 
        10 |       126         28         10 |       164 
        11 |        48          5          6 |        59 
        12 |        12         17         43 |        72 
        13 |         5         10         14 |        29 
        14 |        30         20         23 |        73 
        15 |        16         10         17 |        43 
        16 |       132         71         85 |       288 
        17 |        29          7          9 |        45 
        18 |        33         29         41 |       103 
        19 |        35         14         18 |        67 
        20 |        36        841      1,013 |     1,890 
        21 |         0        250         61 |       311 
        22 |         0        602         10 |       612 
        23 |         1        243          9 |       253 
        24 |         0        474         89 |       563 
        25 |         0        373          3 |       376 
        26 |         0        255        116 |       371 
        27 |         0        119          0 |       119 
        33 |         3          0          0 |         3 
        40 |         1          0          0 |         1 
        94 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     2,206      3,586      1,854 |     7,646 


--------------------------------------------------------------------------
-> state_ORIGINAL = KERALA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         3          0          0 |         3 
         1 |        22          7         11 |        40 
         2 |       125         66         84 |       275 
         3 |         9          9         10 |        28 
         4 |       136         82         73 |       291 
         5 |        45         17         49 |       111 
         6 |       142        127        100 |       369 
         7 |       241        149        160 |       550 
         8 |       288        194        211 |       693 
         9 |        43         15         20 |        78 
        10 |        84         43         58 |       185 
        11 |       110         83         91 |       284 
        12 |        23         11         25 |        59 
        13 |       228        122        164 |       514 
        14 |        74         50         45 |       169 
        18 |         3          0          0 |         3 
        19 |         1          0          0 |         1 
        20 |         2          0          0 |         2 
        24 |         1          0          0 |         1 
        70 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     1,581        975      1,101 |     3,657 


--------------------------------------------------------------------------
-> state_ORIGINAL = LAKSHADWEEP
no observations

--------------------------------------------------------------------------
-> state_ORIGINAL = MADHYA PRADESH

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         8          0          0 |         8 
         1 |        24          0          0 |        24 
         2 |        42          6         19 |        67 
         3 |        47         29         38 |       114 
         4 |         1         21         29 |        51 
         5 |         2          0          2 |         4 
         6 |         7          0          1 |         8 
         7 |         3          6          4 |        13 
         8 |         3          0          0 |         3 
         9 |         4          0          2 |         6 
        10 |        29          0          2 |        31 
        11 |         5         33         22 |        60 
        12 |        37          3          4 |        44 
        13 |        21         19         19 |        59 
        14 |         8          5          8 |        21 
        15 |         8          0          0 |         8 
        16 |        44          0          5 |        49 
        17 |        33          0          2 |        35 
        18 |        53          0          1 |        54 
        19 |         9         20         10 |        39 
        20 |        60         20         12 |        92 
        21 |        11         35         29 |        75 
        22 |       138          9          4 |       151 
        23 |       243         49         50 |       342 
        24 |        27          0          3 |        30 
        25 |        18        117        129 |       264 
        26 |        12        211        237 |       460 
        27 |         9         12         10 |        31 
        28 |        82          6          5 |        93 
        29 |         6          8         13 |        27 
        30 |        55          6          6 |        67 
        31 |         7          0          3 |        10 
        32 |        20         63         56 |       139 
        33 |        86          8          1 |        95 
        34 |         5         31         46 |        82 
        35 |        10          0          4 |        14 
        36 |        30          3          2 |        35 
        37 |         4          4          7 |        15 
        38 |        23         12         15 |        50 
        39 |         0         27         29 |        56 
        40 |        67          2          9 |        78 
        41 |        16          0          0 |        16 
        42 |        55          7          3 |        65 
        43 |        86         19         23 |       128 
        44 |       245          0          1 |       246 
        45 |        12          3         13 |        28 
        80 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     1,716        794        878 |     3,388 


--------------------------------------------------------------------------
-> state_ORIGINAL = MAHARASHTRA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |        13          0          0 |        13 
         1 |     1,766          9          6 |     1,781 
         2 |       832         22         32 |       886 
         3 |       119         65         85 |       269 
         4 |        54         19         33 |       106 
         5 |        30         26         39 |        95 
         6 |       272          1          5 |       278 
         7 |        65         13         26 |       104 
         8 |       138         24         11 |       173 
         9 |       135        177        186 |       498 
        10 |       697          9         21 |       727 
        11 |        66          9         18 |        93 
        12 |       115          3          7 |       125 
        13 |       105         17         29 |       151 
        14 |       189         13         12 |       214 
        15 |       166         20         16 |       202 
        16 |        39          0          1 |        40 
        17 |        14          5          4 |        23 
        18 |        11         22         22 |        55 
        19 |        24        125        144 |       293 
        20 |         3        183        243 |       429 
        21 |        16        475        914 |     1,405 
        22 |        30        790      1,007 |     1,827 
        23 |        72          0          0 |        72 
        24 |        53        107        157 |       317 
        25 |        29        451        615 |     1,095 
        26 |        21         81         93 |       195 
        27 |       321          6         10 |       337 
        28 |        74          9         19 |       102 
        29 |        31          7         10 |        48 
        30 |         3         64         89 |       156 
        31 |         0         56         63 |       119 
        32 |         0         27         34 |        61 
        33 |         0          8          8 |        16 
        34 |         0        121        187 |       308 
        35 |         0         57         88 |       145 
        40 |         3          0          0 |         3 
        41 |         7          0          0 |         7 
        43 |         1          0          0 |         1 
        60 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     5,515      3,021      4,234 |    12,770 


--------------------------------------------------------------------------
-> state_ORIGINAL = MANIPUR

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |         1          0          0 |         1 
         3 |         1          0          0 |         1 
         5 |         3          0          1 |         4 
         6 |         1         21         23 |        45 
         7 |        37          2         11 |        50 
         8 |         1          0          0 |         1 
        17 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |        45         23         35 |       103 


--------------------------------------------------------------------------
-> state_ORIGINAL = MEGHALAYA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |         1          0          1 |         2 
         2 |         1          0          1 |         2 
         4 |         3          0          1 |         4 
         5 |         0          9         39 |        48 
         6 |         3         12         14 |        29 
         7 |         0          3          1 |         4 
        10 |         4          0          0 |         4 
        12 |        10          0          0 |        10 
        14 |         1          0          0 |         1 
        22 |         0          0          1 |         1 
-----------+---------------------------------+----------
     Total |        23         24         58 |       105 


--------------------------------------------------------------------------
-> state_ORIGINAL = MIZORAM
no observations

--------------------------------------------------------------------------
-> state_ORIGINAL = NAGALAND

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |        41          4          2 |        47 
         3 |         0          3          2 |         5 
         5 |         4          0          1 |         5 
         6 |         1         71         61 |       133 
         7 |         6          0          0 |         6 
        13 |         2          0          0 |         2 
-----------+---------------------------------+----------
     Total |        54         78         66 |       198 


--------------------------------------------------------------------------
-> state_ORIGINAL = ORISSA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         2          0          0 |         2 
         1 |        97         14         32 |       143 
         2 |       133          9         13 |       155 
         3 |        17         24         40 |        81 
         4 |        30          0          1 |        31 
         5 |        71         80        106 |       257 
         6 |       143          5         29 |       177 
         7 |        30         16         21 |        67 
         8 |         4         39         42 |        85 
         9 |        34          4          7 |        45 
        10 |        14          0          5 |        19 
        11 |        44         12          4 |        60 
        12 |        46         69         64 |       179 
        13 |       182          5         11 |       198 
        14 |         0          9         11 |        20 
        15 |         0          4          8 |        12 
        16 |         0          0          1 |         1 
        17 |         0         97         87 |       184 
        18 |         0         12          5 |        17 
        19 |         0         24         23 |        47 
        22 |         0          0          1 |         1 
        23 |         0          0          4 |         4 
        24 |         0         12         17 |        29 
        25 |         0          0          8 |         8 
        26 |         0          5         18 |        23 
        27 |         0          9         16 |        25 
        28 |         0          4          5 |         9 
        29 |         0          8         14 |        22 
        30 |         0          0          4 |         4 
        33 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       848        461        597 |     1,906 


--------------------------------------------------------------------------
-> state_ORIGINAL = PONDICHERRY

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         1          0          0 |         1 
         1 |       175         16         26 |       217 
         2 |         4        213        273 |       490 
         3 |         5         27          3 |        35 
         4 |        30         11         20 |        61 
        32 |         1          0          0 |         1 
        33 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |       217        267        322 |       806 


--------------------------------------------------------------------------
-> state_ORIGINAL = PUNJAB

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |         9          0          0 |         9 
         1 |       106         64         90 |       260 
         2 |       230        111        150 |       491 
         3 |        57         34         71 |       162 
         4 |       952        463        332 |     1,747 
         5 |       369        284         56 |       709 
         6 |        85         37         19 |       141 
         7 |        55         49        137 |       241 
         8 |       104         73         52 |       229 
         9 |       240        101      1,041 |     1,382 
        10 |       143         90         24 |       257 
        11 |        60         13         26 |        99 
        12 |        82         38         21 |       141 
        13 |         0         43         15 |        58 
        14 |         1          3         90 |        94 
        15 |         0          0         44 |        44 
        16 |         0          0        172 |       172 
        17 |         0          0        145 |       145 
        19 |         1          0          0 |         1 
        20 |         2          0          0 |         2 
        23 |         1          0          0 |         1 
        34 |         1          0          0 |         1 
        50 |         2          0          0 |         2 
        71 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     2,501      1,403      2,485 |     6,389 


--------------------------------------------------------------------------
-> state_ORIGINAL = RAJASTHAN

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |        12          0          0 |        12 
         1 |        88         20         48 |       156 
         2 |        69         29         49 |       147 
         3 |        13          1         72 |        86 
         4 |         8          5          4 |        17 
         5 |       215        175          4 |       394 
         6 |        33         13        224 |       270 
         7 |         2          0         17 |        19 
         8 |         6         10          6 |        22 
         9 |       398        271          4 |       673 
        10 |        20         10          6 |        36 
        11 |       127         74          0 |       201 
        12 |        17          4        367 |       388 
        13 |         4          0         13 |        17 
        14 |       180        117         30 |       327 
        15 |        36         14        137 |       187 
        16 |       113         30          0 |       143 
        17 |        32         11         24 |        67 
        18 |         4          0          0 |         4 
        19 |        28         18         22 |        68 
        20 |       139         71         37 |       247 
        21 |       121         72        142 |       335 
        22 |        30         16         12 |        58 
        23 |         1          0         12 |        13 
        24 |        13          9         87 |       109 
        25 |        18          3         32 |        53 
        26 |        48         23         68 |       139 
        27 |        12          0          5 |        17 
        28 |         2          0         15 |        17 
        29 |         0          0         36 |        36 
        30 |        27         22         40 |        89 
        31 |         1         13          2 |        16 
        32 |         0          0          3 |         3 
        53 |         1          0          0 |         1 
        81 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     1,819      1,031      1,518 |     4,368 


--------------------------------------------------------------------------
-> state_ORIGINAL = SIKKIM
no observations

--------------------------------------------------------------------------
-> state_ORIGINAL = TAMIL NADU

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |        12          0          0 |        12 
         1 |       450        225        459 |     1,134 
         2 |       769        272        280 |     1,321 
         3 |       221        310        366 |       897 
         4 |       155        127        150 |       432 
         5 |        29         98         16 |       143 
         6 |       104          5         18 |       127 
         7 |       399         24         55 |       478 
         8 |       208        280        166 |       654 
         9 |        59          1         85 |       145 
        10 |       939        120        167 |     1,226 
        11 |       133         43         32 |       208 
        12 |       161        582        804 |     1,547 
        13 |        87         88        111 |       286 
        14 |        60         22         73 |       155 
        15 |        57         58        101 |       216 
        16 |       284          0          3 |       287 
        17 |       487          4          6 |       497 
        18 |        19         36         38 |        93 
        19 |       197         11         14 |       222 
        20 |       143          5          7 |       155 
        21 |        45         24         37 |       106 
        22 |        33         30         47 |       110 
        23 |         8         31         42 |        81 
        24 |         0        153        176 |       329 
        25 |         0         23         38 |        61 
        26 |         0          4         98 |       102 
        27 |         0        420        385 |       805 
        28 |         0        114        132 |       246 
        29 |         0         73         85 |       158 
        30 |         3         28         31 |        62 
        31 |         3          0         94 |        97 
        32 |         1          0          0 |         1 
        37 |         1          0          0 |         1 
        81 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     5,068      3,211      4,116 |    12,395 


--------------------------------------------------------------------------
-> state_ORIGINAL = TRIPURA

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         1 |        56         97        136 |       289 
         2 |        21         24         45 |        90 
         3 |        10          5         11 |        26 
         4 |         0         34         47 |        81 
        12 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |        88        160        239 |       487 


--------------------------------------------------------------------------
-> state_ORIGINAL = UTTAR PRADESH

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |        13          0          0 |        13 
         1 |         3         38         49 |        90 
         2 |         0         59         84 |       143 
         3 |        10        103        108 |       221 
         4 |        59         87        144 |       290 
         5 |         5         29         28 |        62 
         6 |         4         44         50 |        98 
         7 |         7         87        104 |       198 
         8 |       164          5          7 |       176 
         9 |       184        257        280 |       721 
        10 |       191        342        575 |     1,108 
        11 |        56         42         77 |       175 
        12 |       172         38         49 |       259 
        13 |        33         12         24 |        69 
        14 |       146         17         43 |       206 
        15 |       198         85        132 |       415 
        16 |       974         30         56 |     1,060 
        17 |        95          2          7 |       104 
        18 |       109          4         10 |       123 
        19 |        52          6          3 |        61 
        20 |       150         48         64 |       262 
        21 |       120         16         15 |       151 
        22 |        18         29         36 |        83 
        23 |        16         73         30 |       119 
        24 |        11         24         23 |        58 
        25 |        93          4         11 |       108 
        26 |        33         18         39 |        90 
        27 |        66         54         77 |       197 
        28 |        77          6         19 |       102 
        29 |        19          0          7 |        26 
        30 |        11          9          6 |        26 
        31 |        52          5          9 |        66 
        32 |       140          0          3 |       143 
        33 |        21         21         22 |        64 
        34 |         8        150        242 |       400 
        35 |        13          4          7 |        24 
        36 |        69         13         13 |        95 
        37 |       273          0          2 |       275 
        38 |        15          0          3 |        18 
        39 |        37          1          2 |        40 
        40 |         2          0          0 |         2 
        41 |        17          0          1 |        18 
        42 |         2          9         13 |        24 
        43 |        36          0          4 |        40 
        44 |         9          4          4 |        17 
        45 |       122         28         33 |       183 
        46 |        11          4         19 |        34 
        47 |        17         14         14 |        45 
        48 |        36          0          8 |        44 
        49 |        36         11         13 |        60 
        50 |        31          7          8 |        46 
        51 |         4          0          0 |         4 
        52 |        20          4          6 |        30 
        53 |        18          4          2 |        24 
        54 |        55          0          3 |        58 
        55 |        15          2          3 |        20 
        56 |        20          1          2 |        23 
        57 |        32          3          4 |        39 
        58 |        68         19         40 |       127 
        59 |        15          7          7 |        29 
        60 |         7          8          6 |        21 
        61 |       123          6          4 |       133 
        62 |        10          6         11 |        27 
        63 |         5          3          2 |        10 
        64 |         0          9         18 |        27 
        65 |         0          0         11 |        11 
        66 |         0         20         22 |        42 
        67 |         1         29         36 |        66 
        68 |         0          7         20 |        27 
        69 |         0          7         13 |        20 
        70 |         0          5          3 |         8 
        77 |         1          0          0 |         1 
        81 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |     4,431      1,979      2,790 |     9,200 


--------------------------------------------------------------------------
-> state_ORIGINAL = UTTARANCHAL

           |         year
  District |      2000       2005 |     Total
-----------+----------------------+----------
         1 |        46          0 |        46 
         2 |        42          1 |        43 
         3 |        82          0 |        82 
         4 |       335         10 |       345 
         5 |       160        115 |       275 
         6 |       112         13 |       125 
         7 |        60          0 |        60 
         8 |       148          3 |       151 
         9 |         5          5 |        10 
        11 |        43         44 |        87 
        12 |       108        131 |       239 
        13 |       378        125 |       503 
        68 |       220          0 |       220 
        78 |         9          0 |         9 
        79 |        31          0 |        31 
        83 |        47          0 |        47 
-----------+----------------------+----------
     Total |     1,826        447 |     2,273 


--------------------------------------------------------------------------
-> state_ORIGINAL = WEST BENGAL

           |               year
  District |      1994       2000       2005 |     Total
-----------+---------------------------------+----------
         0 |        11          0          0 |        11 
         1 |         2         52         45 |        99 
         2 |       131        102         81 |       314 
         3 |        54          0          6 |        60 
         4 |        10          6         14 |        30 
         5 |        15          8          9 |        32 
         6 |        12          3         24 |        39 
         7 |        39         13         23 |        75 
         8 |       473         19         26 |       518 
         9 |       469         91        144 |       704 
        10 |       161         22         28 |       211 
        11 |       421        300        290 |     1,011 
        12 |       132         89         97 |       318 
        13 |        53          7         36 |        96 
        14 |        30         11         15 |        56 
        15 |        18         33         40 |        91 
        16 |       141        238        265 |       644 
        17 |        30         72        111 |       213 
        18 |         0        272        310 |       582 
        19 |         0          0         32 |        32 
        20 |         2          0          0 |         2 
        23 |         1          0          0 |         1 
        26 |        41          0          0 |        41 
        28 |         1          0          0 |         1 
        60 |         1          0          0 |         1 
        61 |         2          0          0 |         2 
        62 |         2          0          0 |         2 
-----------+---------------------------------+----------
     Total |     2,252      1,338      1,596 |     5,186 



. 
. replace FinalState = proper(state_ORIGINAL) if _m==1 & FinalState==""
(118150 real changes made)

. tab FinalState _m, mi

                      |        _merge
           FinalState | master on  matched ( |     Total
----------------------+----------------------+----------
        A & N Islands |        48          0 |        48 
Andaman & Nicobar Isl |         0      1,335 |     1,335 
       Andhra Pradesh |     8,216     38,448 |    46,664 
    Arunachal Pradesh |         0        468 |       468 
                Assam |     1,992     12,258 |    14,250 
                Bihar |     2,023     23,807 |    25,830 
           Chandigarh |       543        674 |     1,217 
         Chhattisgarh |     3,857      2,243 |     6,100 
 Dadra & Nagar Haveli |       871        514 |     1,385 
          Daman & Diu |     1,017        505 |     1,522 
                Delhi |     3,428      3,893 |     7,321 
                  Goa |       795      1,402 |     2,197 
              Gujarat |    12,168     16,900 |    29,068 
              Haryana |     4,297      7,953 |    12,250 
     Himachal Pradesh |     1,004      7,238 |     8,242 
      Jammu & Kashmir |       772      9,530 |    10,302 
            Jharkhand |     6,242      5,720 |    11,962 
            Karnataka |     7,646     17,661 |    25,307 
               Kerala |     3,657     19,634 |    23,291 
          Lakshadweep |         0        165 |       165 
       Madhya Pradesh |     3,388     19,006 |    22,394 
          Maharashtra |    12,770     33,577 |    46,347 
              Manipur |       103      6,262 |     6,365 
            Meghalaya |       105      2,239 |     2,344 
              Mizoram |         0      2,062 |     2,062 
             Nagaland |       198      3,233 |     3,431 
               Orissa |     1,906     17,634 |    19,540 
          Pondicherry |       806        912 |     1,718 
               Punjab |     6,389     16,244 |    22,633 
            Rajasthan |     4,368     19,289 |    23,657 
               Sikkim |         0        627 |       627 
           Tamil Nadu |    12,395     48,397 |    60,792 
              Tripura |       487      7,709 |     8,196 
        Uttar Pradesh |     9,200     53,198 |    62,398 
          Uttaranchal |     2,273      1,057 |     3,330 
          West Bengal |     5,186     42,667 |    47,853 
----------------------+----------------------+----------
                Total |   118,150    444,461 |   562,611 


. 
. replace district=999 if _m==1 
district was byte now int
(118150 real changes made)

. replace districtname="Unknown" if _m==1 
(118150 real changes made)

. 
. tab districtname year if state_ORIGINAL=="DELHI"

                      |               year
         districtname |      1994       2000       2005 |     Total
----------------------+---------------------------------+----------
              Central |     1,654      2,002          0 |     3,656 
           North East |         0          0         28 |        28 
           North West |         0          0        148 |       148 
                South |         0          0         16 |        16 
           South West |         0          0         16 |        16 
              Unknown |     1,569        719      1,140 |     3,428 
                 West |         0          0         29 |        29 
----------------------+---------------------------------+----------
                Total |     3,223      2,721      1,377 |     7,321 


. replace districtname ="Delhi" if state_ORIGINAL=="DELHI"
(7321 real changes made)

. replace districtname ="Mumbai" if districtname=="Mumbai Suburban"
(0 real changes made)

. replace districtname=trim(districtname)
(0 real changes made)

. drop _m

. ***NOTE THAT THIS MERGE WAS GOOD ONLY FOR NSS NOT ASI
. 
. 
. 
. ***SPECIFIC PREP FOR BORDER ANALYSIS
. keep if year==2005 | year==1994
(246060 observations deleted)

. rename totalemployees totalpersonsengaged

. 
. foreach var of varlist plants totalpersonsengaged totaloutput loanamount
>  totalfixedassets totalrawmaterials  Memployees Femployees{
  2. replace `var'=`var'*multiplier
  3. }
(279260 real changes made)
(279242 real changes made)
(279267 real changes made)
(62533 real changes made)
(269906 real changes made)
(271848 real changes made)
(235459 real changes made)
(130575 real changes made)

. 
. g origsize=totalpersonsengaged/multiplier
(48 missing values generated)

. 
. g start=.
(316551 missing values generated)

. 
. g f_plants_new=plants if under3==1 & organization=="F_Individual Proprie
> torship"
(308355 missing values generated)

. g f_plants_old=plants if under3==0 & organization=="F_Individual Proprie
> torship"
(280984 missing values generated)

. g f_plants=plants if organization=="F_Individual Proprietorship"
(272788 missing values generated)

. g f_emp_new=totalpersonsengaged if under3==1 & organization=="F_Individu
> al Proprietorship"
(308355 missing values generated)

. g f_emp_old=totalpersonsengaged if under3==0 & organization=="F_Individu
> al Proprietorship"
(280984 missing values generated)

. g f_emp=totalpersonsengaged if organization=="F_Individual Proprietorshi
> p"
(272788 missing values generated)

. g f_output=totaloutput if organization=="F_Individual Proprietorship"
(272788 missing values generated)

. g f_assets=totalfixedassets if organization=="F_Individual Proprietorshi
> p"
(273200 missing values generated)

. g f_rawmat=totalrawmaterials if organization=="F_Individual Proprietorsh
> ip"
(274977 missing values generated)

. g f_workers = Femployees
(26019 missing values generated)

. g f_workers_m_plt = Femployees if organization=="M_Individual Proprietor
> ship"
(131399 missing values generated)

. g f_workers_f_plt = Femployees if organization=="F_Individual Proprietor
> ship"
(272788 missing values generated)

. g f_loanamount = loanamount if organization=="F_Individual Proprietorshi
> p"
(314537 missing values generated)

. 
. g f_newpl_HH = plants if under3==1 &  organization=="F_Individual Propri
> etorship" & location=="Household"
(309255 missing values generated)

. g f_oldpl_HH = plants if under3==0 &  organization=="F_Individual Propri
> etorship" & location=="Household"
(284293 missing values generated)

. g f_newpl_NHH = plants if under3==1 &  organization=="F_Individual Propr
> ietorship" & location=="Non-Household"
(315659 missing values generated)

. g f_oldpl_NHH = plants if under3==0 &  organization=="F_Individual Propr
> ietorship" & location=="Non-Household"
(313276 missing values generated)

. 
. 
. g m_plants_new=plants if under3==1 & organization=="M_Individual Proprie
> torship"
(288585 missing values generated)

. g m_plants_old=plants if under3==0 & organization=="M_Individual Proprie
> torship"
(159365 missing values generated)

. g m_plants=plants if organization=="M_Individual Proprietorship"
(131399 missing values generated)

. g m_emp_new=totalpersonsengaged if under3==1 & organization=="M_Individu
> al Proprietorship"
(288585 missing values generated)

. g m_emp_old=totalpersonsengaged if under3==0 & organization=="M_Individu
> al Proprietorship"
(159365 missing values generated)

. g m_emp=totalpersonsengaged if organization=="M_Individual Proprietorshi
> p"
(131399 missing values generated)

. g m_output=totaloutput if organization=="M_Individual Proprietorship"
(131399 missing values generated)

. g m_assets=totalfixedassets if organization=="M_Individual Proprietorshi
> p"
(132206 missing values generated)

. g m_rawmat=totalrawmaterials if organization=="M_Individual Proprietorsh
> ip"
(132947 missing values generated)

. g m_workers = Memployees
(2617 missing values generated)

. g m_workers_m_plt = Memployees if organization=="M_Individual Proprietor
> ship"
(131399 missing values generated)

. g m_workers_f_plt = Memployees if organization=="F_Individual Proprietor
> ship"
(272788 missing values generated)

. 
. g m_newpl_HH = plants if under3==1 &  organization=="M_Individual Propri
> etorship" & location=="Household"
(304365 missing values generated)

. g m_oldpl_HH = plants if under3==0 &  organization=="M_Individual Propri
> etorship" & location=="Household"
(218088 missing values generated)

. g m_newpl_NHH = plants if under3==1 &  organization=="M_Individual Propr
> ietorship" & location=="Non-Household"
(300853 missing values generated)

. g m_oldpl_NHH = plants if under3==0 &  organization=="M_Individual Propr
> ietorship" & location=="Non-Household"
(258166 missing values generated)

. 
. g f_gov_source = plants if (sourceagency1==1 | sourceagency2==1) &  orga
> nization=="F_Individual Proprietorship"
(316492 missing values generated)

. g f_gov_dest = plants if (destagency1==1 | destagency2==1) &  organizati
> on=="F_Individual Proprietorship"
(316479 missing values generated)

. g f_gov_dest_new = plants if (destagency1==1 | destagency2==1) &  organi
> zation=="F_Individual Proprietorship" & under3==1
(316541 missing values generated)

. 
. g m_gov_source = plants if (sourceagency1==1 | sourceagency2==1) &  orga
> nization=="M_Individual Proprietorship"
(316118 missing values generated)

. g m_gov_dest = plants if (destagency1==1 | destagency2==1) &  organizati
> on=="M_Individual Proprietorship"
(316206 missing values generated)

. g m_gov_dest_new = plants if (destagency1==1 | destagency2==1) &  organi
> zation=="M_Individual Proprietorship" & under3==1
(316530 missing values generated)

. 
. g f_plants_new_loan = plants if under3==1 & organization=="F_Individual 
> Proprietorship" & loanamount>0 & loanamount!=.
(316047 missing values generated)

. g m_plants_new_loan = plants if under3==1 & organization=="M_Individual 
> Proprietorship" & loanamount>0 & loanamount!=.
(311317 missing values generated)

. 
. g f_plants_new_noloan = plants if under3==1 & organization=="F_Individua
> l Proprietorship" & (loanamount==0 | loanamount==.)
(308859 missing values generated)

. g m_plants_new_noloan = plants if under3==1 & organization=="M_Individua
> l Proprietorship" & (loanamount==0 | loanamount==.)
(293819 missing values generated)

. 
. 
. 
. g m_workers_ORG = m_workers if survey=="ASI"
(241323 missing values generated)

. g f_workers_ORG = f_workers if survey=="ASI"
(264725 missing values generated)

. 
. 
. g f_plants_new_lt3=plants if under3==1 & organization=="F_Individual Pro
> prietorship" & survey=="NSS" & origsize<=3
(308806 missing values generated)

. g f_plants_new_gt4=plants if under3==1 & organization=="F_Individual Pro
> prietorship" & survey=="NSS" & origsize>=4 & origsize !=.
(316151 missing values generated)

. 
. g m_plants_new_lt3=plants if under3==1 & organization=="M_Individual Pro
> prietorship" & survey=="NSS" & origsize<=3
(296504 missing values generated)

. g m_plants_new_gt4=plants if under3==1 & organization=="M_Individual Pro
> prietorship" & survey=="NSS" & origsize>=4 & origsize !=.
(309147 missing values generated)

. 
. g end=.
(316551 missing values generated)

. collapse (sum) totalpersonsengaged loanamount totaloutput start-end ///
> , by(FinalState nic304 districtname survey year reserved_electionnum res
> ervedYN reservedYN* years_rsvd years_rel_PR )

. 
. order m_workers_ORG f_workers_ORG, after(end)

. 
. ***CLEAN OUT EXISTING ASI DATA FOR COLLAPSE
. foreach i of varlist start-end loanamount totaloutput {
  2. replace `i' = . if survey=="ASI"
  3. }
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)
(2503 real changes made, 2503 to missing)

. 
. collapse (sum) totalpersonsengaged loanamount totaloutput start-end  m_w
> orkers_ORG f_workers_ORG, by(FinalState year districtname years_rel_PR)

. drop start end

. 
. 
. 
. g start=.
(923 missing values generated)

. g f_entship_rate=f_plants_new/f_plants
(113 missing values generated)

. g m_entship_rate=m_plants_new/m_plants
(58 missing values generated)

. g f_entship_rate_emp=f_emp_new/f_emp
(113 missing values generated)

. g m_entship_rate_emp=m_emp_new/m_emp
(58 missing values generated)

. g fm_entrant_ratio=f_plants_new/m_plants_new
(101 missing values generated)

. g fm_entrantemp_ratio=f_emp_new/m_emp_new
(101 missing values generated)

. g end=.
(923 missing values generated)

. keep FinalState year districtname years_rel_PR f_plants_new f_plants f_e
> mp_new f_workers f_workers_m_plt f_workers_f_plt   f_workers_ORG ///
> m_plants_new m_plants m_emp_new m_workers m_workers_m_plt m_workers_f_pl
> t   m_workers_ORG ///
> totalpersonsengaged

. *start-end  m_plants_new m_plants f_emp_new f_emp m_emp_new m_emp 
. *drop start end
. replace FinalState=upper(FinalState)
(923 real changes made)

. 
. drop if districtname=="Unknown"
(59 observations deleted)

. 
. *save "$work/district-level f_entship figures_long.dta", replace
. reshape wide f_plants_new f_plants f_emp_new f_workers f_workers_m_plt f
> _workers_f_plt   f_workers_ORG  m_plants_new m_plants m_emp_new m_worker
> s m_workers_m_plt m_workers_f_plt   m_workers_ORG years_rel_PR totalpers
> onsengaged, i(FinalState districtname) j(year )
(note: j = 1994 2005)

Data                               long   ->   wide
--------------------------------------------------------------------------
> ---
Number of obs.                      864   ->     438
Number of variables                  19   ->      34
j variable (2 values)              year   ->   (dropped)
xij variables:
                           f_plants_new   ->   f_plants_new1994 f_plants_n
> ew2005
                               f_plants   ->   f_plants1994 f_plants2005
                              f_emp_new   ->   f_emp_new1994 f_emp_new2005
                              f_workers   ->   f_workers1994 f_workers2005
                        f_workers_m_plt   ->   f_workers_m_plt1994 f_worke
> rs_m_plt2005
                        f_workers_f_plt   ->   f_workers_f_plt1994 f_worke
> rs_f_plt2005
                          f_workers_ORG   ->   f_workers_ORG1994 f_workers
> _ORG2005
                           m_plants_new   ->   m_plants_new1994 m_plants_n
> ew2005
                               m_plants   ->   m_plants1994 m_plants2005
                              m_emp_new   ->   m_emp_new1994 m_emp_new2005
                              m_workers   ->   m_workers1994 m_workers2005
                        m_workers_m_plt   ->   m_workers_m_plt1994 m_worke
> rs_m_plt2005
                        m_workers_f_plt   ->   m_workers_f_plt1994 m_worke
> rs_f_plt2005
                          m_workers_ORG   ->   m_workers_ORG1994 m_workers
> _ORG2005
                           years_rel_PR   ->   years_rel_PR1994 years_rel_
> PR2005
                    totalpersonsengaged   ->   totalpersonsengaged1994 tot
> alpersonsengaged2005
--------------------------------------------------------------------------
> ---

. save "$work/district-level f_entship figures_2005.dta", replace
file C:/OpenCode/GKO_Reservations_JDE2014_ReplBackup/4work//district-level
>  f_entship figures_2005.dta saved

. 
. 
. 
. erase "$intdata/ASINSS_AppendedMaster_CleanFlagged.dta"

. 
. 
end of do-file
